<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"64a53c81f8899ef1a239e2de5d4931ca31ff4c5f6341c15fa5277fdc87b4d267","plan_job_ref":"Job Terraform plan #30 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132720008","plan_out_hash":"81bdecd979bebb1ad91693beb379b653bd16d323f4a0ddc6611d789b2e101b3f","plan_hash":"0b324730a3b6fad2b643b79f173d4131a634623cc008a9ca9e5d11d279d47a81","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be created
+   resource "yandex_function" "receive-video-handler" {
+       created_at        = (known after apply)
+       entrypoint        = "ReceiveVideoHandler.Handler"
+       execution_timeout = "10"
+       folder_id         = (known after apply)
+       id                = (known after apply)
+       image_size        = (known after apply)
+       loggroup_id       = (known after apply)
+       memory            = 128
+       name              = "receive-video-handler"
+       runtime           = "dotnet8"
+       tags              = (known after apply)
+       user_hash         = "2089d3d114705f43b01e52b2e0b43e9a3b732388ba9d5e08581d0ee6a09a847e"
+       version           = (known after apply)

+       content {
+           zip_filename = "./receive-video-handler.zip"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:x: Plan not applied in [Terraform apply #15](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132721801) (Plan has changed)